# CannotCopyDueToBackgroundCalculation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CannotCopyDueToBackgroundCalculation Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Cannot copy dragged elements while background calculations are in progress.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCopyDueToBackgroundCalculation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCopyDueToBackgroundCalculation As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCopyDueToBackgroundCalculation {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace